STMicroelectronics/STM32DDRFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Source/Templates/gcc/startup_stm32mp23xx_a35.c
void TIM14_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM10_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void RNG_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void ADF1_FLT_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void I2C6_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void COMBOPHY_WAKEUP_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void I2C7_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void I2C8_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void I3C4_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SDMMC3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void LPTIM2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void LPTIM3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void LPTIM4_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void LPTIM5_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void OTFDEC2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void CPU2_SEV_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void CPU3_SEV_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void RCC_WAKEUP_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SAI4_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void DTS_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void TIM11_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void CPU1_WAKEUP_PIN_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void USB3DR_BC_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void USB3DR_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void UCPD1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_AER_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_AERM_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_BW_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_BWM_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_BWAUTO_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_BWAUTOM_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_PME_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_PMEM_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_SYSERR_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void SERF_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void BUSPERFM_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void RAMCFG_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void DDRCTRL_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void DDRPHYC_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void DFI_ERR_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void IAC_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void VDDCPU_VD_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void VDDCORE_VD_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void RETRAMCRC_ERR_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void ETHSW_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void ETHSW_MSGBUF_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void ETHSW_FSC_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA1_WKUP_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA2_WKUP_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void HPDMA3_WKUP_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void LPDMA_WKUP_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void UCPD1_VBUS_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void UCPD1_VSAFE5V_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void RCC_HSI_FMON_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void VDDGPU_VD_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_PTMRDY_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_PTMUPD_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_INTA_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_INTB_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_INTC_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_INTD_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI1_0_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI1_1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI1_2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI1_3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI1_4_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI1_5_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI1_6_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI1_7_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI1_8_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI1_9_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI1_10_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI1_11_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI1_12_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI1_13_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI1_14_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void EXTI1_15_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void IS2M_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void L2WERR_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void DDRPERFM_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMSTAT0_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMSTAT1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMSTAT2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMSTAT3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMSTAT4_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMSTAT5_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMSTAT6_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMSTAT7_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMSTAT8_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMSTAT9_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMSTAT10_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMSTAT11_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMSTAT12_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMSTAT13_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMSTAT14_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMSTAT15_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMSTAT16_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSIGBL_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI0_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI2_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI3_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI4_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI5_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI6_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI7_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI8_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI9_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI10_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI11_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI12_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI13_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI14_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI15_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI16_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI17_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI18_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI19_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI20_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI21_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI22_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI23_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI24_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI25_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI26_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI27_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI28_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI29_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI30_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PCIE_MSI31_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMUIRQ0_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void PMUIRQ1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void COMMRX0_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void COMMRX1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void COMMTX0_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void COMMTX1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void nCTIIRQ0_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));
void nCTIIRQ1_IRQHandler (void) __attribute__ ((weak, alias("Default_ITHandler")));

/*----------------------------------------------------------------------------
  EL3-EL1 Interface parameters
 *----------------------------------------------------------------------------*/
void EL3_EL1_Interface(void)
{
  /* Fill EL3-EL1 interface following structure : */
  /* - EL1 entry-point (Reset_Handler) address    */
#if defined(A35_STARTUP_IN_ARM_MODE)
  __asm__ volatile(".WORD   start_reset_handler");
#else
  __asm__ volatile(".WORD   Reset_Handler");
#endif /* defined(A35_STARTUP_IN_ARM_MODE) */
  /* - EL1 Vector table address                   */
  __asm__ volatile(".WORD   vector_table_addr");
  /* - EL3-EL1 interface identification in ASCII format */
  /*   set to "EL3L" ("EL3 Launcher") by default        */
  __asm__ volatile(".WORD   0x454C334C");
  /* - EL1 Aarch32 security state                   */
  /*   applied to A35_0 core only in AMP mode       */
  /*   or to both A35_0/A35_1 in SMP mode :         */
  /*   . Code for switching A35_0 resp. A35_0/A35_1 */
  /*     to EL1 Aarch32 non-secure state            */
#ifdef A35_NON_SECURE
  __asm__ volatile(".WORD   0xAA3205E1");
  /*     or to EL1 Aarch32 secure state             */
#else
  __asm__ volatile(".WORD   0xAA325EC1");
#endif /* A35_NON_SECURE */
  /* - Memory start address of EL1 A35_0 (AMP) / A35_* (SMP) application */
  __asm__ volatile(".WORD   __MEM_START__");
  /* - Memory end address of EL1 A35_0 (AMP) / A35_* (SMP) application */
  __asm__ volatile(".WORD   FIQ_STACK-1");
  /* - EL3-EL1 interface location for A35_1 core (AMP mode) */
  __asm__ volatile(
#ifdef A35_X_IN_AMP_MODE
  ".WORD   FIQ_STACK  \n"
  /*   or padding word to fill memory (SMP mode)            */
#else
  ".WORD   0x0        \n"
#endif /* A35_X_IN_AMP_MODE */
  /* - Dummy data for alignment */
  ".HWORD   0x0       \n"
  );
}

/*----------------------------------------------------------------------------
  Exception / Interrupt Vector Table
 *----------------------------------------------------------------------------*/
void Vectors(void) {
  __asm__ volatile(
  "vector_table_addr:         \n"
  "B      Reset_Handler       \n"
  "B      Undef_Handler       \n"
  "B      SVC_Handler         \n"
  "B      PAbt_Handler        \n"
  "B      DAbt_Handler        \n"
  "B      Rsvd_Handler        \n"
  "B      IRQ_Handler         \n"
  "B      FIQ_Handler         \n"
  /* - Dummy data for alignment */
  ".HWORD   0x0               \n"
  );
}

