STMicroelectronics/STM32DDRFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Source/Templates/gcc/startup_stm32mp23xx_a35.c
  /* - Clean and invalidate data cache */
  /*   As described in 4.3.1 "Cleaning and invalidating the caches" */
  /*   at pages 21-22 of [ARM DAI 0527A] :                          */
  /*   "In ARMv8-A processors and most ARMv7-A processors,          */
  /*    you do not have to do this because hardware automatically   */
  /*    invalidates all cache RAMs after reset."                    */

  /* - Invalidate branch predictor */
  /*   (see G6.2.21 "BPIALL, Branch Predictor Invalidate All" */
  /*    in [ARM_DDI_0487B.a])      */
  "MCR     p15, 0, r0, c7, c5, 6                   \n"  /* Write BPIALL */
  "ISB                                             \n"

  /* Enable the MMU and caches */
  /* - enable Symmetric Multi-Processing according to selection   */
  /*   by setting CPUECTLR bit 6 "SMPEN" accordingly              */
  /*   (see B.1.43 "CPU Extended Control Register" in [A35_TRM]   */
  /*                                                              */
  /*   WARNING ! Only settable in EL3 (see code of EL3 launcher)  */

  /* - enable instruction cache, branch predictor and MMU */
  /*   by setting SCTLR bits 0 "M" and 12 "I" */
  /*   (see B1.105 "System Control Register" in [A35_TRM] */
  /*   Note : Branch prediction not controllable on A35 (bit 11 = res1) */
  "MRC     p15, 0, R0, c1, c0, 0                   \n"  /* Read SCTLR register */
  "ORR     R0, R0, #(0x1 << 12)                    \n"  /* Set bit "I" (Instruction Cache) */
  "ORR     R0, R0, #0x1                            \n"  /* Set bit "M" (Memory Management Unit) */
  "MCR     p15, 0, R0, c1, c0, 0                   \n"  /* Write SCTLR register */
  "DSB                                             \n"
  "ISB                                             \n"
  );
#endif /* ! NO_A35_MMU_CACHE_ENABLE */

  __asm__ volatile(
#if defined(A35_STARTUP_IN_ARM_MODE)
  /* Force ARM mode (vs Thumb mode forced by build toolchain) */
  ".code 32                                        \n"
#endif /* defined(A35_STARTUP_IN_ARM_MODE) */
  "after_mmu_cache_config:                         \n"

#if !defined(NEON_FPU_OFF)
  /* Enable NEON and Floating Point */
  /* (see 4.4 at pages 28-29 in [ARM_DAI_0527A]) */
  /* "In AArch32 mode, access to NEON technology and FP functionality */
  /*  is disabled by default, so it must be explicitly enabled"       */
  /* - Enable access to NEON/FP by enabling access to Coprocessors 10 and 11. */
  /*   Enable Full Access in both privileged and non-privileged modes */
  /*   by setting CPACR bits [23:20] "CP11" & "CP10" to 0b1111 */
  /*   see B1.41 "Architectural Feature Access Control Register" in [A35_TRM] */
  "MOVS    r0, #0                                  \n"
  "ORR     r0, r0, #(0xF << 20)                    \n"
  "MCR     p15, 0, r0, c1, c0, 2                   \n"
  "ISB                                             \n"
  /* - Switch on the FP and NEON hardware  */
  /*   by setting FPEXC bit 30 "EN" to 0b1 */
  /*   (see G6.2.49 "FPEXC, Floating-Point Exception Control register" */
  /*    in [ARM_DDI_0487B.a])              */
  "MOVS    r1, #0                                  \n"
  "ORR     r1, r1, #(0x1 << 30)                    \n"
  "VMSR    FPEXC, r1                               \n"
#endif /* !defined(NEON_FPU_OFF) */

  /* Unmask interrupts */
  "CPSIE  if                                       \n"

  /* Initialize libc */
  "BL __libc_init_array                            \n"

  /* Call __main */
  "BL     main                                     \n"
  );
}

/*----------------------------------------------------------------------------
  Default vector handlers for vector table
 *----------------------------------------------------------------------------*/
__attribute__ ((weakref("While1_UndefITHandler"))) static void Default_Undef_Handler(void);
__attribute__ ((weakref("Nop_ITHandler"))) static void Default_SVC_Handler(void);
__attribute__ ((weakref("While1_PAbtITHandler"))) static void Default_PAbt_Handler(void);
__attribute__ ((weakref("While1_DAbtITHandler"))) static void Default_DAbt_Handler(void);
__attribute__ ((weakref("While1_RsvdITHandler"))) static void Default_Rsvd_Handler(void);
__attribute__ ((weakref("Nop_ITHandler"))) static void Default_IRQ_Handler(void);
__attribute__ ((weakref("Nop_ITHandler"))) static void Default_FIQ_Handler(void);

/*----------------------------------------------------------------------------
  Default IT handler for interrupt table
 *----------------------------------------------------------------------------*/
__attribute__ ((weak, alias("While1_ITHandler"))) void Default_ITHandler(void);
/* Fix debugger use of equivalent weak symbols */
__attribute__ ((weak, alias("Default_ITHandler"))) void AAA_Default_ITHandler(void);

/*----------------------------------------------------------------------------
  Weak interrupt handlers for default definition for vector and interrupt tables
 *----------------------------------------------------------------------------*/
__attribute__ ((interrupt)) void Nop_ITHandler(void)
{
  return;
}
__attribute__ ((interrupt)) void While1_UndefITHandler(void)
{
  while(1);
}
__attribute__ ((interrupt)) void While1_DAbtITHandler(void)
{
  while(1);
}
__attribute__ ((interrupt)) void While1_PAbtITHandler(void)
{
  while(1);
}
__attribute__ ((interrupt)) void While1_RsvdITHandler(void)
{
  while(1);
}
__attribute__ ((interrupt)) void While1_ITHandler(void)
{
  while(1);
}
